frontend/views/admin/post-manage.php

use yii\grid\GridView;
use yii\helpers\Html;

$dataProvider = new ActiveDataProvider([
    'query' => \common\models\Post::find(),
    'pagination' => [
        'pageSize' => 4,
    ],
]);
---
SELECT * FROM `post` LIMIT 4
SELECT COUNT(*) FROM `post`