frontend/views/admin/user-manage.php

SELECT * FROM `user` LIMIT 5
SELECT COUNT(*) FROM `user`
---
use yii\grid\GridView;
use yii\helpers\Html;

$dataProvider = new ActiveDataProvider([
    'query' => User::find(),
    'pagination' => [
        'pageSize' => 5,
    ],
]);