frontend/controllers/MessageController.php

    public function actionShowInbox()
    {
        Message::updateAll(['is_notified' => 1], 'is_notified=0 AND receiver_id=' .\Yii::$app->user->getId());

        $query = Message::find()->where(['receiver_id' => \Yii::$app->user->getId()])->orderBy('status');

        $pagination = new Pagination([
            'defaultPageSize' => 15,
            'totalCount' => $query->count(),
        ]);

        $listMsg = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
UPDATE `message` SET `is_notified`=1 WHERE is_notified=0 AND receiver_id=11
SELECT COUNT(*) FROM `message` WHERE `receiver_id`=11 ORDER BY `status`
SELECT * FROM `message` WHERE `receiver_id`=11 ORDER BY `status` LIMIT 15

    public function actionShowOutbox()
    {
        $query = Message::find()->where(['sender_id' => \Yii::$app->user->getId()])->orderBy('status');

        $pagination = new Pagination([
            'defaultPageSize' => 15,
            'totalCount' => $query->count(),
        ]);

        $listMsg = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `message` WHERE `sender_id`=11 ORDER BY `status`
SELECT * FROM `message` WHERE `sender_id`=11 ORDER BY `status` LIMIT 15

    public function actionShowDrafts()
    {
        $query = Message::find()->where(['sender_id' => \Yii::$app->user->getId(), 'status' => -1]);

        $pagination = new Pagination([
            'defaultPageSize' => 15,
            'totalCount' => $query->count(),
        ]);

        $listMsg = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `message` WHERE (`sender_id`=11) AND (`status`=-1)
SELECT * FROM `message` WHERE (`sender_id`=11) AND (`status`=-1) LIMIT 15

    public function actionRead($id)
    {
        $model = Message::findOne(['id' => $id]);
        $model['status'] = 1;
        $model->save();
---
SELECT * FROM `message` WHERE `id`='41'
UPDATE `message` SET `status`=1 WHERE `id`=41