frontend/controllers/NotificationController.php

UPDATE `post_notification` SET `status`=1 WHERE status=0 AND receiver_id=8
---
    public function actionMakeOldRelationshipNotification()
    {
        RelationshipNotification::updateAll(['status' => 1], 'status=0 AND receive_id=' .\Yii::$app->user->getId());

UPDATE `message` SET `is_notified`=1 WHERE is_notified=0 AND receiver_id=8
---
    public function actionMakeOldMessageNotification()
    {
        Message::updateAll(['is_notified' => 1], 'is_notified=0 AND receiver_id=' .\Yii::$app->user->getId());