frontend/controllers/PostController.php

    public function actionShowAll()
    {
        if (Yii::$app->user->isGuest) {
            $this->redirect(Url::to(['/site/login']));
        }

        $query = Post::find()->where(['user_id' => Yii::$app->user->getId()]);

        $pagination = new Pagination([
            'defaultPageSize' => 4,
            'totalCount' => $query->count(),
        ]);

        $list_post = $query->orderBy('id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->asArray()
            ->all();
---
SELECT COUNT(*) FROM `post` WHERE `user_id`=11
SELECT * FROM `post` WHERE `user_id`=11 ORDER BY `id` LIMIT 4