frontend/controllers/UserController.php

    public function actionFindUsername()
    {
        if (isset($_POST['username'])) {
            $username = $_POST['username'];
        } else {
            $username = "";
        }

        $model = User::find()->where(['username' => $username])->asArray()->all();
---
SELECT * FROM `user` WHERE `username`='messi'

    public function actionShowFriendTimeline($id)
    {
        $model = User::findOne(['id' => $id]);
---
SELECT * FROM `user` WHERE `id`='8'