common/models/Post.php

    public static function getPostById($id)
    {
        return Post::findOne(['id' => $id]);
---
SELECT * FROM `post` WHERE `id`='23'