frontend/views/layouts/header.php

SELECT * FROM `user` WHERE `id`=8
SELECT COUNT(*) FROM `post` WHERE `user_id`=8
SELECT COUNT(*) FROM `relationship` WHERE (`user_id_1`=8) AND (`status`=1)
SELECT COUNT(*) FROM `relationship` WHERE (`user_id_2`=8) AND (`status`=1)
SELECT * FROM `relationship_notification` WHERE `receive_id`=8 ORDER BY `status` LIMIT 20
SELECT COUNT(*) FROM `relationship_notification` WHERE (`receive_id`=8) AND (`status`=0)
SELECT * FROM `message` WHERE `receiver_id`=8 ORDER BY `is_notified` LIMIT 20
SELECT COUNT(*) FROM `message` WHERE (`receiver_id`=8) AND (`is_notified`=0)
---

/* @var $this \yii\web\View */
/* @var $content string */
$model = \common\models\User::findOne(['id' => Yii::$app->user->getId()]);
$postCount = \common\models\Post::find()->where(['user_id' => $model['id']])->count();
$friendCount = \common\models\Relationship::find()->where(['user_id_1' => $model['id'], 'status' => 1])->count()
    + \common\models\Relationship::find()->where(['user_id_2' => $model['id'], 'status' => 1])->count();

$listNewRelNotify = \common\models\RelationshipNotification::find()->where(['receive_id' => Yii::$app->user->getId()])->orderBy('status')->limit(20)->asArray()->all();
$newRelNotifyCount = \common\models\RelationshipNotification::find()->where(['receive_id' => Yii::$app->user->getId(), 'status' => 0])->count();
$listNewMsgNotify = \common\models\Message::find()->where(['receiver_id' => Yii::$app->user->getId()])->orderBy('is_notified')->limit(20)->asArray()->all();
$newMsgNotifyCount = \common\models\Message::find()->where(['receiver_id' => Yii::$app->user->getId(), 'is_notified' => 0])->count();

SELECT * FROM `user` WHERE `id`='4'
---
                            <ul class="menu">
                                <?php
                                foreach ($listNewMsgNotify as $msgNotify) {
                                    $sender = \common\models\User::findOne(['id' => $msgNotify['sender_id']]);

SELECT * FROM `post_notification` WHERE `receiver_id`=8 ORDER BY `status` LIMIT 20
SELECT COUNT(*) FROM `post_notification` WHERE (`receiver_id`=8) AND (`status`=0)
---
                    </ul>
                </li>
                <?php
                $listPostNotify = \common\models\PostNotification::find()->where(['receiver_id' => Yii::$app->user->getId()])->limit(20)->orderBy('status')->asArray()->all();
                $newPostNotifyCount = \common\models\PostNotification::find()->where(['receiver_id' => Yii::$app->user->getId(), 'status' => 0])->count();

SELECT * FROM `user` WHERE `id`='4'
SELECT COUNT(*) FROM `post` WHERE (`id`='23') AND (`user_id`=8)
---
<!--                                </li>-->
                                <?php
                                foreach ($listPostNotify as $notify) {
                                    $user = \common\models\User::findOne(['id' => $notify['action_id']]);
                                    if ($user['fullname'] == '') {$name = $user['username'];} else {$name = $user['fullname'];}
                                    $isOwnPost = \common\models\Post::find()->where(['id' => $notify['post_id'], 'user_id' => Yii::$app->user->getId()])->count() > 0;

SELECT * FROM `user` WHERE `id`='4'
---
                            <ul class="menu">
                                <?php
                                foreach ($listNewRelNotify as $newRelNotify) {
                                    $userAction = \common\models\User::findOne(['id' => $newRelNotify['action_id']]);

SELECT * FROM `schedule_notification` WHERE `receiver_id`=8
---
                <!-- User Account: style can be found in dropdown.less -->
                <li class="notify_rel dropdown tasks-menu">
                    <?php
                    $listScheduleNotify = \common\models\ScheduleNotification::find()->where(['receiver_id' => Yii::$app->user->getId()])->asArray()->all();