frontend/models/MessageCreateForm.php

INSERT INTO `message` (`subject`, `content`, `create_at`, `status`, `sender_id`, `receiver_id`) VALUES ('dep zai', '<p>=)))</p>\r\n', '2015-12-16 01:00', 0, 11, 8)
---
    public function addMessage()
    {
        foreach ($this->receiver as $receiverId) {
            $message = new Message();
            $message['subject'] = $this->subject;
            $message['content'] = $this->content;
            $message['create_at'] = $this->create_at;
            $message['status'] = $this->status;
            $message['sender_id'] = $this->sender_id;
            $message['receiver_id'] = $receiverId;
            $message->save();