frontend/views/user/friend-timeline.php

$this->title = 'Tham quan';
$this->params['breadcrumbs'][] = $this->title;

$listPost = \common\models\Post::find()->where(['user_id' => $model['id']])->asArray()->all();
---
SELECT * FROM `post` WHERE `user_id`=8

        }
    }
}
$friendCount = \common\models\Relationship::find()->where(['user_id_1' => $model['id'], 'status' => 1])->count()
    + \common\models\Relationship::find()->where(['user_id_2' => $model['id'], 'status' => 1])->count();
---
SELECT COUNT(*) FROM `relationship` WHERE (`user_id_1`=8) AND (`status`=1)
SELECT COUNT(*) FROM `relationship` WHERE (`user_id_2`=8) AND (`status`=1)

                    $user_id_1 = $user_id_2;
                    $user_id_2 = $tg;
                }
                $isFriend = \common\models\Relationship::findOne(['user_id_1' => $user_id_1, 'user_id_2' => $user_id_2, 'status' => 1]) != null;
                $pendingRelationship = \common\models\Relationship::findOne(['user_id_1' => $user_id_1, 'user_id_2' => $user_id_2, 'status' => 0]);
---
SELECT * FROM `relationship` WHERE (`user_id_1`=8) AND (`user_id_2`=11) AND (`status`=1)
SELECT * FROM `relationship` WHERE (`user_id_1`=8) AND (`user_id_2`=11) AND (`status`=0)

                <div class="active tab-pane" id="activity">
                    <?php
                        foreach ($listPost as $post) {
                            $cmtCount = \common\models\Comment::find()->where(['post_id' => $post['id']])->count();
---
SELECT COUNT(*) FROM `comment` WHERE `post_id`='23'