frontend/views/user/search-user-item.php

 * Date: 10/13/2015
 * Time: 10:15 PM
 */
$postCount = \common\models\Post::find()->where(['user_id' => $model['id']])->count();
$friendCount = \common\models\Relationship::find()->where(['user_id_1' => $model['id'], 'status' => 1])->count()
    + \common\models\Relationship::find()->where(['user_id_2' => $model['id'], 'status' => 1])->count();
---
SELECT COUNT(*) FROM `post` WHERE `user_id`='8'
SELECT COUNT(*) FROM `relationship` WHERE (`user_id_1`='8') AND (`status`=1)
SELECT COUNT(*) FROM `relationship` WHERE (`user_id_2`='8') AND (`status`=1)