frontend/views/message/inbox.php

SELECT COUNT(*) FROM `message` WHERE (`receiver_id`=11) AND (`status`=0)
---
$this->title = 'Tin nhắn';
$this->params['breadcrumbs'][] = $this->title;

$newCount = \common\models\Message::find()->where(['receiver_id' => Yii::$app->user->getId(), 'status' => 0])->count();