frontend/views/message/outbox.php

$this->title = 'Tin nhắn';
$this->params['breadcrumbs'][] = $this->title;

$newCount = \common\models\Message::find()->where(['receiver_id' => Yii::$app->user->getId(), 'status' => 0])->count();
---
SELECT COUNT(*) FROM `message` WHERE (`receiver_id`=11) AND (`status`=0)

                        <tbody>
                        <?php
                        foreach ($model as $item) {
                            $user = \common\models\User::findOne(['id' => $item['receiver_id']]);
---
SELECT * FROM `user` WHERE `id`=8