frontend/views/message/read.php

 */
$this->title = 'Tin nhắn';
$this->params['breadcrumbs'][] = $this->title;
$newCount = \common\models\Message::find()->where(['receiver_id' => Yii::$app->user->getId(), 'status' => 0])->count();
---
SELECT COUNT(*) FROM `message` WHERE (`receiver_id`=8) AND (`status`=0)

                <div class="mailbox-read-info">
                    <h3><?= $model['subject'] ?></h3>
                    <h5>From: <?php
                        $user = \common\models\User::findOne(['id' => $model['sender_id']]);
---
SELECT * FROM `user` WHERE `id`=11

                        }
                        ?> <span class="mailbox-read-time pull-right"><?= $model['create_at'] ?></span></h5>
                    <h5>To: <?php
                        $user = \common\models\User::findOne(['id' => $model['receiver_id']]);
---
SELECT * FROM `user` WHERE `id`=8