frontend/views/site/index.php

SELECT * FROM `post` WHERE `create_at`='2015-12-16'
---
$this->title = "Bài viết trong ngày";
$this->params['breadcrumbs'][] = $this->title;

$listPost = \common\models\Post::find()->where(['create_at' => date('Y-m-d')])->asArray()->all();